{
  "Spells": [
    {
      "Name": "Light",
      "Type": 4,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "Touch",
      "ComponentV": true,
      "ComponentS": false,
      "ComponentM": "a firefly or phosphorescent moss",
      "Duration": "1 hour",
      "Concentration": false,
      "Description": "You touch one object that is no larger than \\ft{10} in any dimension. Until the spell ends, the object sheds bright light in a \\ft{20} radius and dim light for an additional \\ft{20}. The light cant be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action. If you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell",
      "Display": "Light (Evocation Cantrip)"
    },
    {
      "Name": "Minor Illusion",
      "Type": 5,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "30",
      "ComponentV": false,
      "ComponentS": true,
      "ComponentM": "a bit of fleece",
      "Duration": "1 minute",
      "Concentration": false,
      "Description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again. If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends. If you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a \\ft{5} cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it. If a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
      "Display": "Minor Illusion (Illusion Cantrip)"
    },
    {
      "Name": "Mage Hand",
      "Type": 1,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "30",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "1 minute",
      "Concentration": false,
      "Description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than \\ft{30} away from you or if you cast this spell again. You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to \\ft{30} each time you use it. The hand can’t attack, activate magical items, or carry more than 10 pounds.",
      "Display": "Mage Hand (Conjuration Cantrip)"
    },
    {
      "Name": "Green-Flame Blade",
      "Type": 4,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "30",
      "ComponentV": true,
      "ComponentS": false,
      "ComponentM": "a weapon",
      "Concentration": false,
      "Description": "As part of the action used to cast this spell, you must make a melee attack with a weapon against one creature within the spell’s range, otherwise the spell fails. On a hit, the target suffers the attack’s normal effects, and green fire leaps from the target to a different creature of your choice that you can see within \\ft{5} of it. The second creature takes fire damage equal to your spellcasting modifier.",
      "AtHigherLevels": "This spell’s damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 fire damage to the target, and the fire damage to the second creature increases to 1d8 + your spellcasting ability modifier. Both damage rolls increase by 1d8 at 11th level and 17th level.",
      "Display": "Green-Flame Blade (Evocation Cantrip)"
    },
    {
      "Name": "Sleep",
      "Type": 3,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "90",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "a pinch of find sand, rose petals, or a cricket",
      "Concentration": false,
      "Description": "This spell sends creatures into a magical slumber. Roll 5d8, the total is how many hit points of creatures this spell can affect. Creatures within \\ft{20} of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures). Starting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for that creature to be affected. Undead and creatures immune to being charmed aren’t affected by this spell.",
      "AtHigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st.",
      "Display": "Sleep (Enchantment Level1)"
    },
    {
      "Name": "Invisibility",
      "Type": 5,
      "Level": 2,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "Touch",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "an eyelash encased in gum arabic",
      "Duration": "1 hour",
      "Concentration": true,
      "Description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person. The spell ends for a target that attacks or casts a spell.",
      "AtHigherLevels": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
      "Display": "Invisibility (Illusion Level2)"
    }
  ]
}