{
  "Format": "|\\begin{spell}\r\n\t{|0|}\r\n\t{|1|}\r\n\t{|2|}\r\n\t{|3|}\r\n\t{|4|}\r\n\t{|5|}\r\n|6|\r\n\r\n\\textbf{|8|} |7|\r\n\\end{spell}",
  "Spells": [
    {
      "Name": "Light",
      "Type": 4,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "Touch",
      "ComponentV": true,
      "ComponentS": false,
      "ComponentM": "a firefly or phosphorescent moss",
      "Duration": "1 hour",
      "Concentration": false,
      "Description": "You touch one object that is no larger than \\ft{10} in any dimension. Until the spell ends, the object sheds bright light in a \\ft{20} radius and dim light for an additional \\ft{20}. The light cant be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action. If you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell",
      "Display": "Light (Evocation Cantrip)"
    },
    {
      "Name": "Minor Illusion",
      "Type": 5,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "30",
      "ComponentV": false,
      "ComponentS": true,
      "ComponentM": "a bit of fleece",
      "Duration": "1 minute",
      "Concentration": false,
      "Description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again. If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends. If you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a \\ft{5} cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it. If a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
      "Display": "Minor Illusion (Illusion Cantrip)"
    },
    {
      "Name": "Mage Hand",
      "Type": 1,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "30",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "1 minute",
      "Concentration": false,
      "Description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than \\ft{30} away from you or if you cast this spell again. You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to \\ft{30} each time you use it. The hand can’t attack, activate magical items, or carry more than 10 pounds.",
      "Display": "Mage Hand (Conjuration Cantrip)"
    },
    {
      "Name": "Green-Flame Blade",
      "Type": 4,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "30",
      "ComponentV": true,
      "ComponentS": false,
      "ComponentM": "a weapon",
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "As part of the action used to cast this spell, you must make a melee attack with a weapon against one creature within the spell’s range, otherwise the spell fails. On a hit, the target suffers the attack’s normal effects, and green fire leaps from the target to a different creature of your choice that you can see within \\ft{5} of it. The second creature takes fire damage equal to your spellcasting modifier.",
      "AtHigherLevels": "This spell’s damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 fire damage to the target, and the fire damage to the second creature increases to 1d8 + your spellcasting ability modifier. Both damage rolls increase by 1d8 at 11th level and 17th level.",
      "Display": "Green-Flame Blade (Evocation Cantrip)"
    },
    {
      "Name": "Sleep",
      "Type": 3,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "90",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "a pinch of find sand, rose petals, or a cricket",
      "Duration": "1 minute",
      "Concentration": false,
      "Description": "This spell sends creatures into a magical slumber. Roll 5d8, the total is how many hit points of creatures this spell can affect. Creatures within \\ft{20} of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures). Starting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for that creature to be affected. Undead and creatures immune to being charmed aren’t affected by this spell.",
      "AtHigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st.",
      "Display": "Sleep (Enchantment Level1)"
    },
    {
      "Name": "Invisibility",
      "Type": 5,
      "Level": 2,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "Touch",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "an eyelash encased in gum arabic",
      "Duration": "1 hour",
      "Concentration": true,
      "Description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person. The spell ends for a target that attacks or casts a spell.",
      "AtHigherLevels": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
      "Display": "Invisibility (Illusion Level2)"
    },
    {
      "Name": "Detect Magic",
      "Type": 2,
      "Level": 1,
      "Ritual": true,
      "CastingTime": "1 action",
      "Range": "Self",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "10 minutes",
      "Concentration": true,
      "Description": "For the duration, you sense the presence of magic within \\ft{30} of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but is blocked by \\ft{1} of stone, 1 inch of common metal, a thin sheet of lead, or \\ft{3} of wood or dirt.",
      "Display": "Detect Magic (Divination Level1)"
    },
    {
      "Name": "Alarm",
      "Type": 0,
      "Level": 1,
      "Ritual": true,
      "CastingTime": "1 minute",
      "Range": "30",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "A tiny bell and a piece of fine silver wire",
      "Duration": "8 hours",
      "Concentration": false,
      "Description": "You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a \\ft{20} cube. Until the spell ends, an alarm alerts you whenever a tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. You also choose whether the alarm is mental or audible.\r\n\r\nA mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping.\r\n\r\nAn audible alarm produces the sound of a hand bell for 10 seconds within \\ft{60}.",
      "Display": "Alarm (Abjuration Level1)"
    },
    {
      "Name": "Comprehend Languages",
      "Type": 2,
      "Level": 1,
      "Ritual": true,
      "CastingTime": "1 action",
      "Range": "Self",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "A pinch of soot and salt",
      "Duration": "1 hour",
      "Concentration": false,
      "Description": "For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text.\r\n\r\nThis spell doesn’t decode secret messages in a text or a glyph, such as an arcane sigil, that isn’t part of a written language.",
      "Display": "Comprehend Languages (Divination Level1)"
    },
    {
      "Name": "Identify",
      "Type": 2,
      "Level": 1,
      "Ritual": true,
      "CastingTime": "1 minute",
      "Range": "Touch",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "A pearl worth at least 100 gp and an owl feather",
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "You choose one object that you must touch throughout the casting of the spell. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any spells are affecting the item and what they are. If the item was created by a spell, you learn which spell created it.\r\n\r\nIf you instead touch a creature throughout the casting, you learn what spells, if any, are currently affecting it.",
      "Display": "Identify (Divination Level1)"
    },
    {
      "Name": "Burning Hands",
      "Type": 4,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "Self",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a \\ft{15} cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.\r\n\r\nThe fire ignites any flammable objects in the area that aren't being worn or carried.",
      "AtHigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.",
      "Display": "Burning Hands (Evocation Level1)"
    },
    {
      "Name": "Mage Armor",
      "Type": 0,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "Touch",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "A piece of cured leather",
      "Duration": "8 hours",
      "Concentration": false,
      "Description": "You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its Dexterity modifier. The spell ends it if the target dons armor or if you dismiss the spell as an action.",
      "Display": "Mage Armor (Abjuration Level1)"
    },
    {
      "Name": "Magic Missile",
      "Type": 4,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "120",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4+1 force damage to its target. The darts all strike simultaneously and you can direct them to hit one creature or several.\r\n",
      "AtHigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot above 1st.",
      "Display": "Magic Missile (Evocation Level1)"
    },
    {
      "Name": "Create Bonfire",
      "Type": 1,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "60",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "1 minute",
      "Concentration": true,
      "Description": "You create a bonfire on ground that you can see within range. Until the spells ends, the bonfire fills a \\ft{5} cube. Any creature in the bonfire’s space when you cast the spell must succeed on a Dexterity saving throw or take 1d8 fire damage. A creature must also make the\r\nsaving throw when it enters the bonfire’s space for the first time on a turn or ends its turn there. The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
      "Display": "Create Bonfire (Conjuration Cantrip)"
    },
    {
      "Name": "Fire Bolt",
      "Type": 4,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "120",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried.",
      "AtHigherLevels": "This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)",
      "Display": "Fire Bolt (Evocation Cantrip)"
    },
    {
      "Name": "Ray of Frost",
      "Type": 4,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "60",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.",
      "AtHigherLevels": "The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
      "Display": "Ray of Frost (Evocation Cantrip)"
    },
    {
      "Name": "Fireball",
      "Type": 4,
      "Level": 3,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "150",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "A tiny ball of bat guano and sulfur",
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "A bright streak flashes from your pointing finger to a point you choose within range then blossoms with a low roar into an explosion of flame. Each creature in a \\ft{20} radius sphere centered on that point must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.\r\n\r\nThe fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried.",
      "AtHigherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.",
      "Display": "Fireball (Evocation Level3)"
    },
    {
      "Name": "Poison Spray",
      "Type": 1,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "10",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a Constitution saving throw or take 1d12 poison damage. \r\n\r\nThis spell's damage increases by 1d12 when you reach 5th level (2d12), 11th level (3d12), and 17th level (4d12).",
      "Display": "Poison Spray (Conjuration Cantrip)"
    },
    {
      "Name": "Expeditious Retreat",
      "Type": 7,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 bonus action",
      "Range": "Self",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "10 minutes",
      "Concentration": true,
      "Description": "This spell allows you to move at an incredible pace. When you cast this spell, and then as a bonus action on each of your turns until the spell ends, you can take the Dash action.",
      "Display": "Expeditious Retreat (Transmutation Level1)"
    },
    {
      "Name": "Chromatic Orb",
      "Type": 4,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "90",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "50gp diamond",
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "Make a ranged spell attack against a creature you can see. You choose the damage type: acid, cold, fire, lightning, poison, or thunder. If the attack hits, the creature takes 3d8 damage of the type you chose.",
      "AtHigherLevels": "The damage increases by 1d8 for each slot level above 1st.",
      "Display": "Chromatic Orb (Evocation Level1)"
    },
    {
      "Name": "Scorching Ray",
      "Type": 4,
      "Level": 2,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "120",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several.\r\n\r\nMake a ranged spell attack for each ray. On a hit, the target takes 2d6 fire damage.",
      "AtHigherLevels": "When you cast this spell using a spell slot of 3rd level or higher, you create one additional ray for each slot level above 2nd.",
      "Display": "Scorching Ray (Evocation Level2)"
    },
    {
      "Name": "Thunderclap",
      "Type": 4,
      "Level": 0,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "Self (\\ft{5} radius)",
      "ComponentV": false,
      "ComponentS": true,
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "You create a burst of thunderous sound, which can be heard \\ft{100} away. Each creature other than you within \\ft{5} of you must make a Constitution saving throw. On a failed save, the creature takes 1d6 thunder damage.",
      "AtHigherLevels": "The spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
      "Display": "Thunderclap (Evocation Cantrip)"
    },
    {
      "Name": "Sanctuary",
      "Type": 0,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 bonus action",
      "Range": "30",
      "ComponentV": true,
      "ComponentS": true,
      "ComponentM": "a small silver mirror",
      "Duration": "1 minute",
      "Concentration": false,
      "Description": "You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn’t protect the warded creature from area effects, such as the explosion of a fireball.\r\n\r\nIf the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends.",
      "Display": "Sanctuary (Abjuration Level1)"
    },
    {
      "Name": "Inflict Wounds",
      "Type": 6,
      "Level": 1,
      "Ritual": false,
      "CastingTime": "1 action",
      "Range": "Touch",
      "ComponentV": true,
      "ComponentS": true,
      "Duration": "Instantaneous",
      "Concentration": false,
      "Description": "Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage.",
      "AtHigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st.",
      "Display": "Inflict Wounds (Necromancy Level1)"
    }
  ]
}